Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
thorization_scopes = []
        id                   = "agm-v762unlmie-c6hkxf-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id has changed
  ~ resource "aws_api_gateway_method" "analyses-id" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-4v9wtn-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-dl7fdc-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-dl7fdc-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-4v9wtn-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses_post has changed
  ~ resource "aws_api_gateway_method" "analyses_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-c6hkxf-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples has changed
  ~ resource "aws_api_gateway_method" "biosamples" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-9si70o-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-csbk6t-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-csbk6t-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id has changed
  ~ resource "aws_api_gateway_method" "biosamples-id" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-t0ywlh-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-85ixzl-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-85ixzl-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-5l41w9-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-5l41w9-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-e3nia7-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-e3nia7-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-t0ywlh-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples_post has changed
  ~ resource "aws_api_gateway_method" "biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-9si70o-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.configuration has changed
  ~ resource "aws_api_gateway_method" "configuration" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-vydbgg-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets has changed
  ~ resource "aws_api_gateway_method" "datasets" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-qtucp9-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-w1wby7-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-w1wby7-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id has changed
  ~ resource "aws_api_gateway_method" "datasets-id" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-9xvb5z-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-mtxjxl-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-mtxjxl-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-792vzj-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-792vzj-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-f2n5b0-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-f2n5b0-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-1lyw8p-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-1lyw8p-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-9xvb5z-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets_post has changed
  ~ resource "aws_api_gateway_method" "datasets_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-qtucp9-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.dportal_proxy has changed
  ~ resource "aws_api_gateway_method" "dportal_proxy" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-9axqx3-ANY"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.entry_types has changed
  ~ resource "aws_api_gateway_method" "entry_types" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ipuy16-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.filtering_terms has changed
  ~ resource "aws_api_gateway_method" "filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ij3rel-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants has changed
  ~ resource "aws_api_gateway_method" "g_variants" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-fpksft-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id has changed
  ~ resource "aws_api_gateway_method" "g_variants-id" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-jx2hyi-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-q7yacr-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-q7yacr-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-w3i82v-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-w3i82v-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-jx2hyi-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants_post has changed
  ~ resource "aws_api_gateway_method" "g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-fpksft-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals has changed
  ~ resource "aws_api_gateway_method" "individuals" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-oftg7w-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ushf3y-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ushf3y-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id has changed
  ~ resource "aws_api_gateway_method" "individuals-id" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-zf02l6-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-s5128d-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-s5128d-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-keddks-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-keddks-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-zf02l6-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals_post has changed
  ~ resource "aws_api_gateway_method" "individuals_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-oftg7w-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.info has changed
  ~ resource "aws_api_gateway_method" "info" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-dsu5w5-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.map has changed
  ~ resource "aws_api_gateway_method" "map" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-lyhhyp-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.projects has changed
  ~ resource "aws_api_gateway_method" "projects" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-xsqlmr-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.root-get has changed
  ~ resource "aws_api_gateway_method" "root-get" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-djl68tnr6f-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs has changed
  ~ resource "aws_api_gateway_method" "runs" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ayp129-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-e3975s-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-e3975s-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id has changed
  ~ resource "aws_api_gateway_method" "runs-id" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ybyrl8-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-qtdi1n-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-qtdi1n-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-abo0y5-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-abo0y5-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post has changed
  ~ resource "aws_api_gateway_method" "runs-id_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ybyrl8-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs_post has changed
  ~ resource "aws_api_gateway_method" "runs_post" {
      + authorization_scopes = []
        id                   = "agm-v762unlmie-ayp129-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.qcnotes-get has changed
  ~ resource "aws_api_gateway_integration" "qcnotes-get" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-c17d0i-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.qcnotes-options has changed
  ~ resource "aws_api_gateway_integration" "qcnotes-options" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-c17d0i-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.qcnotes-post has changed
  ~ resource "aws_api_gateway_integration" "qcnotes-post" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-c17d0i-POST"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.results-get has changed
  ~ resource "aws_api_gateway_integration" "results-get" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-8fokhf-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.results-options has changed
  ~ resource "aws_api_gateway_integration" "results-options" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-8fokhf-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.submit-options has changed
  ~ resource "aws_api_gateway_integration" "submit-options" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-8mz9m4-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.submit-patch has changed
  ~ resource "aws_api_gateway_integration" "submit-patch" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-8mz9m4-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.submit-post has changed
  ~ resource "aws_api_gateway_integration" "submit-post" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-8mz9m4-POST"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-options has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-options" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-27oto7-OPTIONS"
      + request_parameters      = {}
        # (15 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-27oto7-PATCH"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-post" {
      + cache_key_parameters    = []
        id                      = "agi-hxkar84v63-27oto7-POST"
      + request_parameters      = {}
      + request_templates       = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.qcnotes-get has changed
  ~ resource "aws_api_gateway_integration_response" "qcnotes-get" {
        id                  = "agir-hxkar84v63-c17d0i-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.qcnotes-post has changed
  ~ resource "aws_api_gateway_integration_response" "qcnotes-post" {
        id                  = "agir-hxkar84v63-c17d0i-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.results-get has changed
  ~ resource "aws_api_gateway_integration_response" "results-get" {
        id                  = "agir-hxkar84v63-8fokhf-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-patch has changed
  ~ resource "aws_api_gateway_integration_response" "submit-patch" {
        id                  = "agir-hxkar84v63-8mz9m4-PATCH-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-post has changed
  ~ resource "aws_api_gateway_integration_response" "submit-post" {
        id                  = "agir-hxkar84v63-8mz9m4-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-patch" {
        id                  = "agir-hxkar84v63-27oto7-PATCH-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-post" {
        id                  = "agir-hxkar84v63-27oto7-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.qcnotes-get has changed
  ~ resource "aws_api_gateway_method" "qcnotes-get" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-c17d0i-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.qcnotes-options has changed
  ~ resource "aws_api_gateway_method" "qcnotes-options" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-c17d0i-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.qcnotes-post has changed
  ~ resource "aws_api_gateway_method" "qcnotes-post" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-c17d0i-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.results-get has changed
  ~ resource "aws_api_gateway_method" "results-get" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-8fokhf-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.results-options has changed
  ~ resource "aws_api_gateway_method" "results-options" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-8fokhf-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.submit-options has changed
  ~ resource "aws_api_gateway_method" "submit-options" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-8mz9m4-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.submit-patch has changed
  ~ resource "aws_api_gateway_method" "submit-patch" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-8mz9m4-PATCH"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.submit-post has changed
  ~ resource "aws_api_gateway_method" "submit-post" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-8mz9m4-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-options has changed
  ~ resource "aws_api_gateway_method" "vcfstats-options" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-27oto7-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-patch has changed
  ~ resource "aws_api_gateway_method" "vcfstats-patch" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-27oto7-PATCH"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-post has changed
  ~ resource "aws_api_gateway_method" "vcfstats-post" {
      + authorization_scopes = []
        id                   = "agm-hxkar84v63-27oto7-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user.admin is tainted, so must be replaced
-/+ resource "aws_cognito_user" "admin" {
      ~ attributes            = {
          - "sub"            = "e1599d56-10e1-70af-119d-594439bf8b86" -> null
            # (5 unchanged elements hidden)
        }
      ~ creation_date         = "2025-07-25T04:16:29Z" -> (known after apply)
      ~ id                    = "ap-southeast-3_l5J5oX5o7/admin@example.com" -> (known after apply)
      ~ last_modified_date    = "2025-07-25T04:16:29Z" -> (known after apply)
      ~ mfa_setting_list      = [] -> (known after apply)
      ~ password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      ~ status                = "FORCE_CHANGE_PASSWORD" -> (known after apply)
      ~ sub                   = "e1599d56-10e1-70af-119d-594439bf8b86" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + region       = "ap-southeast-3"
      + user_pool_id = "ap-southeast-3_l5J5oX5o7"
      + username     = "admin@example.com"
    }

  # module.sbeacon.aws_api_gateway_deployment.BeaconApi must be replaced
+/- resource "aws_api_gateway_deployment" "BeaconApi" {
      ~ created_date = "2025-07-25T04:31:04Z" -> (known after apply)
      ~ id           = "xien8q" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "redeployment" = "94813f5e9d3a59781017f7821dc093b6e52940f7" -> "ad525f45da9f303a3fb8f944384595590516e0e2"
        }
        # (3 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "BeaconApi" {
      ~ deployment_id         = "xien8q" -> (known after apply)
        id                    = "ags-v762unlmie-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_deployment.VPApi must be replaced
+/- resource "aws_api_gateway_deployment" "VPApi" {
      ~ created_date = "2025-07-25T04:24:08Z" -> (known after apply)
      ~ id           = "haaxjp" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "redeployment" = "6fc6cd799fdc38107148481c38c0b44ab3916430" -> "6960f2a4b5e2bb0f461f221696d79f17b19be510"
        }
        # (3 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_stage.VPApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "VPApi" {
      ~ deployment_id         = "haaxjp" -> (known after apply)
        id                    = "ags-hxkar84v63-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-customMessageLambdaTrigger"
      ~ last_modified                  = "2025-07-25T04:16:05.024+0000" -> (known after apply)
      + source_code_hash               = "cWl6tHoYSDrkKk/q5ew9YMpvrK51pUQHVEXvraE6EpM="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-logEmailDelivery"
      ~ last_modified                  = "2025-07-25T04:16:10.641+0000" -> (known after apply)
      + source_code_hash               = "mAaNRInjYwC+V0er9eA64kwcLNHwoFHr7WpfbtyAg2Q="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
      ~ last_modified                  = "2025-07-25T04:16:16.229+0000" -> (known after apply)
      + source_code_hash               = "8/8BsNQX/2fRcVJx8AgDAzsZH5UpIt5524gbW0es/Uk="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
      ~ last_modified                  = "2025-07-25T04:15:59.346+0000" -> (known after apply)
      + source_code_hash               = "mnIu7ZdCENB9OEy+IKDwlpgghrJNY/JPRxXZjdbo/Mg="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "error-catcher-notifyOnError"
      ~ last_modified                  = "2025-07-25T04:16:16.694+0000" -> (known after apply)
      + source_code_hash               = "0bYff7flrpHFsgYSqtiE1+73Fq66CY7oXqBtYPrtqUM="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "error-catcher"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-07-25T04:29:32.442+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "5DIQDa7Mp8lbt2hNTHTVEUkMwk3G+PGA4XpdyYweRxg="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-07-25T04:30:09.689+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "ndkAKecJ6LmC6mKLEgkAurr04BU9ICPviS2fQeax4CI="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2025-07-25T04:29:21.093+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:54",
        ] -> (known after apply)
      + source_code_hash               = "Ae3s4WV2ciab3kV8SfGEmY8PdXhTHBm/a8NYYSP8xkw="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ last_modified                  = "2025-07-25T04:29:39.113+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:54",
        ] -> (known after apply)
      + source_code_hash               = "B+myK3mg3GumEYiIgURUWY0hjta2qzKFhSL+r7DsVaQ="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-07-25T04:16:09.196+0000" -> (known after apply)
      + source_code_hash               = "36Rx4gmRKWOQmu3zGpoKR+9u/qns158xuXsVPE8iOHA="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ last_modified                  = "2025-07-25T04:30:21.753+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "160jggxSIVuZuEK1HzCgiKMu3fuEuAeMKeI2+vTg5Yw="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ last_modified                  = "2025-07-25T04:30:16.016+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "gx8RvXmtu7QxdDJteEaLKr+2lKaVjWEgmP8pmcS8Ho4="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ last_modified                  = "2025-07-25T04:29:15.420+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "/yx9/mmh1OEBpMAKAaoPzGmtaU2g1FZ6fVqgyYRYvtI="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-07-25T04:30:44.141+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "h4vSfKOavdYq81SGhZukbVDGz2MVRomSnkpdJpyd/0k="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ last_modified                  = "2025-07-25T04:29:26.754+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "bdjBabB3jcN+fKO03Yhu1d2XH9+LfT+ZD4rhgbGgLt0="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ last_modified                  = "2025-07-25T04:29:50.872+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "S2w/YGupP8V+utXFSoDiSwhjEy4ymQUWTOESmc57Fwg="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ last_modified                  = "2025-07-25T04:30:32.983+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "6yjlIuGDOBegsBdAqmW56vypRg1UtUDrUO7yHrHJq54="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ last_modified                  = "2025-07-25T04:30:27.355+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "rYEcnAlo2CgbzbhAkUFgGcsUNqmHUY34Cj5so9XBFKM="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ last_modified                  = "2025-07-25T04:29:45.184+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "dHOOpyhYxZr89EJMhmRFYIRoP1F2hU1DKyehZ+GZOVA="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ last_modified                  = "2025-07-25T04:29:09.702+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "mFUlhjCjLNL+ZFxaaVdpHEkZN2DSvE5OlwwkiPn+y5E="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ last_modified                  = "2025-07-25T04:28:52.604+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "29mkyu+805b0U0aL4gWjhxapPXMqNsRu8kD4KcmBq+w="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ last_modified                  = "2025-07-25T04:30:38.550+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "zhPcvr2+HHYMgOmUopDvwwK25ObqJZ2Dmzj2dxjdJls="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ last_modified                  = "2025-07-25T04:29:56.570+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "03FmhDjBSEKwLx4eIlrCCDNXPIk18goGFQcGV3KEpbI="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ last_modified                  = "2025-07-25T04:29:04.018+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:54",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "kiSfo70fZFiQ5aRiKuUkRonshpD4Zh8nrcW8bF7Q+sI="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ last_modified                  = "2025-07-25T04:30:02.268+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "dyAXAG78lMsfqkvQ/gLUgRszzqBwu+281FE8NN9Z5Gk="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ last_modified                  = "2025-07-25T04:28:58.211+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:54",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:26",
        ] -> (known after apply)
      + source_code_hash               = "VIV+2z3bmnYDjfwATti6yWA+frj3xHfervuTyDs2tmI="
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57" -> (known after apply)
      ~ code_sha256                 = "gR/nGpHpRMxFLhWYgPm3yPE24V/y+ZKMZgOuYwqqMIo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-25T04:28:52.367+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:57" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/c17ae449bd3243428e87bc6a3c22d41c843107957d7be79c43aa071dd085c4e9.zip" -> "builds/2b6911ade94c497397fd184c29645fcc0503cc2e0b02d89d9c23b0136a102e76.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23840378 -> (known after apply)
      ~ version                     = "57" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/c17ae449bd3243428e87bc6a3c22d41c843107957d7be79c43aa071dd085c4e9.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "4a458bb8f796c284972564548ce039fc-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/c17ae449bd3243428e87bc6a3c22d41c843107957d7be79c43aa071dd085c4e9.zip" -> (known after apply)
      ~ key                           = "builds/c17ae449bd3243428e87bc6a3c22d41c843107957d7be79c43aa071dd085c4e9.zip" -> "builds/2b6911ade94c497397fd184c29645fcc0503cc2e0b02d89d9c23b0136a102e76.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/c17ae449bd3243428e87bc6a3c22d41c843107957d7be79c43aa071dd085c4e9.zip" -> "builds/2b6911ade94c497397fd184c29645fcc0503cc2e0b02d89d9c23b0136a102e76.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] must be replaced
+/- resource "local_file" "archive_plan" {
      ~ content              = jsonencode(
          ~ {
              ~ filename      = "builds/c17ae449bd3243428e87bc6a3c22d41c843107957d7be79c43aa071dd085c4e9.zip" -> "builds/2b6911ade94c497397fd184c29645fcc0503cc2e0b02d89d9c23b0136a102e76.zip"
                # (3 unchanged attributes hidden)
            } # forces replacement
        )
      ~ content_base64sha256 = "mCE+Uk7uPQuaCUoHyDVsBW2d9YfC70ZGr7wbxNKZXlo=" -> (known after apply)
      ~ content_base64sha512 = "ue7U7PH3P2Qqe19AFZUOOgODcKpCrfMNJbotmxxqkCZVuW2xlLUYWpjFqPBtqMlajfiAmmuqqaYT4onHLgYcSw==" -> (known after apply)
      ~ content_md5          = "4818a56c2ffee31582067b39ba89cdc9" -> (known after apply)
      ~ content_sha1         = "00209f5ce1ccdcec49cf3da68407483aa392cc01" -> (known after apply)
      ~ content_sha256       = "98213e524eee3d0b9a094a07c8356c056d9df587c2ef4646afbc1bc4d2995e5a" -> (known after apply)
      ~ content_sha512       = "b9eed4ecf1f73f642a7b5f4015950e3a038370aa42adf30d25ba2d9b1c6a902655b96db194b5185a98c5a8f06da8c95a8df8809a6baaa9a613e289c72e061c4b" -> (known after apply)
      ~ filename             = "builds/c17ae449bd3243428e87bc6a3c22d41c843107957d7be79c43aa071dd085c4e9.plan.json" -> "builds/2b6911ade94c497397fd184c29645fcc0503cc2e0b02d89d9c23b0136a102e76.plan.json" 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.